Revit 2024 API
BuiltInFailures.DatumPlaneFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.DatumPlaneFailures type exposes the following members.
Properties
Name | Description
ScopeBoxWrongPosition
 The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box.
See Also
BuiltInFailures.DatumPlaneFailures Class
Autodesk.Revit.DB Namespace